awesome_app/app/controllers/beers_controller.rb

SELECT "tastings"."beer_api_id" FROM "tastings" WHERE "tastings"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def search # receives GET request from user#show looking for beers and renders the search results page
# read API key from config/local_env.yml
    apiKey = ENV["BEER_API_KEY"]

# build the query string
    userQuery = params[:search].chomp
    @APIurl = "http://api.brewerydb.com/v2/search/?key=" << apiKey << "&q='" << userQuery << "'&type=beer&withBreweries=y"

# hit the API for search results
    request = HTTParty.get(@APIurl)

# further filter the API results based on the filter param in the search page
    filter = params[:filter]
    beersUserTasted = User.find(session[:user_id]).tastings.pluck("beer_api_id")

    if filter == "Top Results"
      @beers = request["data"].take(15)
      # @alreadyTasted creates an array of true/false based on whether the beer is already User.tastings
      @alreadyTasted = @beers.map { |beer| beersUserTasted.include?(beer["id"]) }

SELECT  "beers".* FROM "beers" WHERE "beers"."beer_api_id" = $1 LIMIT 1  [["beer_api_id", "zDYbgT"]]
SELECT "tastings".* FROM "tastings" WHERE "tastings"."user_id" = $1 AND "tastings"."beer_api_id" = $2  [["user_id", 1], ["beer_api_id", "JQPA1R"]]
INSERT INTO "beers" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "no description provided"], ["created_at", "2015-08-31 19:01:30.622895"], ["updated_at", "2015-08-31 19:01:30.622895"]]
INSERT INTO "tastings" ("user_id", "beer_id", "beer_api_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["beer_id", 6], ["beer_api_id", "JQPA1R"], ["created_at", "2015-08-31 17:35:07.312781"], ["updated_at", "2015-08-31 17:35:07.312781"]]
---
  def create
# grabbing form data based on the value of the radio button that was selected
    id = params[:beer_id]
    name = params[:"#{id}_name"]
    description = params[:"#{id}_description"] || "no description provided"
    abv = params[:"#{id}_abv"]
    image_url = params[:"#{id}_image_url"]
    brewery_name = params[:"#{id}_brewery_name"]

    if id
      # confirming that beer has a name and is not "nil"
      if !Beer.find_by(beer_api_id: id) && Tasting.where({user_id: session[:user_id], beer_api_id: id}).length == 0
        puts "~~~~~~~~~BEER NOT FOUND~~~~~~~~~~"
        newBeer = Beer.create({beer_api_id: id, name: name, description: description, abv: abv, image_url: image_url, brewery_name: brewery_name})
        Tasting.create({user_id: session[:user_id], beer_id: newBeer.id, beer_api_id: id})