awesome_app/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "beer_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["beer_id", 1], ["content", "fhgf"], ["created_at", "2015-08-31 22:28:06.804691"], ["updated_at", "2015-08-31 22:28:06.804691"]]
---
	def create
		if (session[:user_id])
			Comment.create({user_id: session[:user_id], beer_id: comment_params[:beer_id], content: comment_params[:content]})