awesome_app/app/controllers/sessions_controller.rb

  def create
    user = User.find_by({name: params[:name]})
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "ashley"]]