awesome_app/app/controllers/users_controller.rb

  def create
    @new_user = User.create(user_params)
 	  user = User.find_by({name: params[:user][:name]})
---
INSERT INTO "users" ("name", "password_digest", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Susan"]]

  def show
    actual_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

    def update
       @user = User.find(session[:user_id])
       if logged_in? && check_current_user?
        @user.update(image_url: params[:image])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "image_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image_url", "http://biodegradablegeek.com/wp-content/uploads/2008/06/8.png"], ["updated_at", "2015-08-29 22:43:17.235565"], ["id", 3]]