awesome_app/app/views/users/show.html.erb

				<ul>
					<% beer.tastings.each do |taste| %>
---
SELECT  "tastings".* FROM "tastings" WHERE "tastings"."user_id" = $1 LIMIT 1  [["user_id", 2]]